app/controllers/songs_controller.rb

  def new
    #binding.pry
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def create
    #binding.pry
    if song_params[:artist_id]
      @artist = Artist.find_by(id: song_params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = Song.new(song_params)
      end
    else
      @song = Song.new(song_params)
      @artist = Artist.find_or_create_by(name: song_params[:artist_name])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Blur"], ["created_at", "2016-01-27 00:20:14.513159"], ["updated_at", "2016-01-27 00:20:14.513159"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a test song!"], ["artist_id", 1], ["created_at", "2016-02-01 09:00:33.478413"], ["updated_at", "2016-02-01 09:00:33.478413"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", "Blur"]]